{
  "backend/main.mo": "Empty Motoko actor serving as a placeholder backend with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report documenting three implemented features: scheduling page with service request form, Schedule Service navigation link, and logo replacement with confidence levels and test IDs.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing components, pages, styling, and routing for the R Irrigation website.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark theme variables for the design system.",
  "frontend/index.html": "HTML entry point with root div and module script reference to main.tsx for the React application.",
  "frontend/src/App.tsx": "Main React application with TanStack Router configuration defining all routes (home, services, areas, reviews, contact, schedule, city pages) wrapped in Header/Footer layout.",
  "frontend/src/components/CTABlock.tsx": "Call-to-action section component with prominent phone number, Schedule Online, and Request Free Estimate buttons in gradient background.",
  "frontend/src/components/Footer.tsx": "Footer component with contact information, service areas list, estimate request form with state management, and caffeine.ai attribution.",
  "frontend/src/components/Header.tsx": "Sticky header with R Irrigation logo, responsive navigation menu including Schedule Service link, phone number, Get Free Estimate CTA, and mobile menu toggle.",
  "frontend/src/components/HeroSection.tsx": "Hero section component with headline, CTA buttons (call, schedule, estimate), and trust indicators for a sprinkler/irrigation service business in Northern NJ.",
  "frontend/src/components/ReviewsSection.tsx": "Displays three customer testimonials in a card grid layout with 5-star ratings and location information.",
  "frontend/src/components/ServiceAreaSection.tsx": "Shows service coverage areas with Clifton as primary location and lists cities in Bergen and Passaic counties with a link to view all areas.",
  "frontend/src/components/ServicesGrid.tsx": "Grid of six service cards (repair, installation, startup, winterization, leak detection, upgrades) with icons and descriptions.",
  "frontend/src/components/WhyChooseUs.tsx": "Four-column benefit section highlighting fast service, experienced technicians, reliable work, and local Northern NJ expertise with icons.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages an ICP backend actor, handling both authenticated and anonymous identities with automatic query invalidation on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file for React Query hooks that would interact with the backend.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a water/lawn themed color palette (blue primary, green secondary) for light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the App component.",
  "frontend/src/pages/CliftonNJ.tsx": "Location-specific landing page for Clifton, NJ featuring sprinkler repair services, benefits, and a prominent call-to-action with phone number (973) 955-8340.",
  "frontend/src/pages/Contact.tsx": "Contact page with business information (phone, email, service area, hours) and a form for requesting free estimates with fields for name, phone, email, service type, and message.",
  "frontend/src/pages/HackensackNJ.tsx": "Location-specific landing page for Hackensack, NJ highlighting sprinkler service offerings including maintenance, repairs, and seasonal services with local benefits.",
  "frontend/src/pages/Home.tsx": "Main homepage component that composes six sections: HeroSection, WhyChooseUs, ServicesGrid, ServiceAreaSection, ReviewsSection, and CTABlock.",
  "frontend/src/pages/ParamusNJ.tsx": "Location-specific landing page for Paramus, NJ showcasing comprehensive irrigation services including design, installation, maintenance, and smart technology upgrades.",
  "frontend/src/pages/Reviews.tsx": "Customer reviews page displaying nine 5-star testimonials from various Northern NJ locations with service types, customer names, and detailed feedback.",
  "frontend/src/pages/Schedule.tsx": "Service scheduling form page with validation for contact info, service type, date/time selection, and success confirmation screen after submission.",
  "frontend/src/pages/ServiceAreas.tsx": "Service areas page listing Clifton as primary location with Bergen County and Passaic County cities, some with dedicated detail page links.",
  "frontend/src/pages/Services.tsx": "Services overview page displaying six irrigation services (repair, installation, startup, winterization, leak detection, upgrades) with icons, descriptions, and detail lists.",
  "frontend/src/pages/WayneNJ.tsx": "SEO-optimized city page for Wayne, NJ featuring sprinkler repair services, benefits list, prominent phone CTA, and local service messaging.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom OKLCH color system, container settings, extended theme properties, and animation utilities.",
  "project_state.json": "Project metadata tracking R Irrigation website features, architecture notes, color scheme (deep blue/bright green), and completed feature implementations."
}