{
  "backend/main.mo": "Empty Motoko actor serving as a placeholder backend canister with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report documenting 13 implemented features for R Irrigation website including header, hero section, services grid, reviews, contact forms, and SEO-optimized city pages with high confidence ratings.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing components, pages, styling, and routing for the R Irrigation contractor website.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining OKLCH color system for light and dark modes, including primary/secondary colors and design tokens.",
  "frontend/index.html": "HTML entry point with root div and module script reference to main.tsx for React application mounting.",
  "frontend/src/App.tsx": "Main React application using TanStack Router to define routes for home, services, service areas, reviews, contact, and four city-specific pages, wrapped in Header/Footer layout.",
  "frontend/src/components/CTABlock.tsx": "Call-to-action section component with gradient background, large phone number button, and request estimate button encouraging immediate contact.",
  "frontend/src/components/Footer.tsx": "Footer component with contact information, service areas list, estimate request form with controlled inputs, and caffeine.ai attribution with UTM tracking.",
  "frontend/src/components/Header.tsx": "Sticky header with R Irrigation logo, responsive navigation menu with active state tracking, prominent phone number, Get Free Estimate CTA, and mobile hamburger menu.",
  "frontend/src/components/HeroSection.tsx": "Hero section component with headline, CTA buttons (call and contact), background image, and trust indicators for a sprinkler/irrigation service business in Northern NJ.",
  "frontend/src/components/ReviewsSection.tsx": "Displays three customer testimonials in a card grid layout with 5-star ratings, reviewer names, and locations from Northern NJ.",
  "frontend/src/components/ServiceAreaSection.tsx": "Shows service coverage areas with Clifton as primary location and lists cities in Bergen and Passaic counties, with a link to view all service areas.",
  "frontend/src/components/ServicesGrid.tsx": "Grid layout displaying six irrigation services (repair, installation, startup, winterization, leak detection, upgrades) with icons and descriptions.",
  "frontend/src/components/WhyChooseUs.tsx": "Four-column benefits section highlighting fast service, experienced technicians, reliable work, and local Northern NJ expertise with icons.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages an ICP backend actor, handling authenticated and anonymous states based on Internet Identity.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login state, identity storage, and AuthClient lifecycle.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file for React Query hooks that would interact with backend data operations.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a water/lawn themed color palette (blue primary, green secondary) for light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the App component.",
  "frontend/src/pages/CliftonNJ.tsx": "Location-specific landing page for Clifton, NJ featuring sprinkler repair services, benefits, and a prominent call-to-action with phone number (973) 955-8340.",
  "frontend/src/pages/Contact.tsx": "Contact page with business information (phone, email, service area, hours) and a form for requesting free estimates with fields for name, phone, email, service type, and message.",
  "frontend/src/pages/HackensackNJ.tsx": "Location-specific landing page for Hackensack, NJ highlighting comprehensive sprinkler service offerings including maintenance, repairs, and seasonal services.",
  "frontend/src/pages/Home.tsx": "Main homepage component that composes six sections: HeroSection, WhyChooseUs, ServicesGrid, ServiceAreaSection, ReviewsSection, and CTABlock.",
  "frontend/src/pages/ParamusNJ.tsx": "Location-specific landing page for Paramus, NJ showcasing irrigation services including design, installation, maintenance, and smart technology upgrades.",
  "frontend/src/pages/Reviews.tsx": "Customer reviews page displaying nine 5-star testimonials from various Northern NJ locations with service types, ratings, and customer feedback in a grid layout.",
  "frontend/src/pages/ServiceAreas.tsx": "Service areas page displaying R Irrigation's coverage in Northern New Jersey, featuring Clifton as the primary city with same-day service, and listing cities in Bergen County (Paramus, Hackensack, etc.) and Passaic County (Wayne, Paterson, etc.) with links to detailed city pages where available.",
  "frontend/src/pages/Services.tsx": "Services page showcasing six irrigation services (Sprinkler Repair, Installation, Spring Startup, Winterization, Leak Detection, System Upgrades) with icons, descriptions, and detailed bullet points for each service, plus a call-to-action section.",
  "frontend/src/pages/WayneNJ.tsx": "SEO-optimized city page for Wayne, NJ featuring localized sprinkler repair services, benefits for Wayne residents, prominent phone CTA, and service/benefit lists with checkmark icons.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom OKLCH color system for theming (primary, secondary, muted, etc.), container settings, custom shadows, accordion animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state document describing a mobile-first local service website for R Irrigation with deep blue/bright green color scheme, multi-page structure including city-specific SEO pages, and tracking of implemented features like header, hero section, services grid, and reviews."
}