{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add online scheduling and replace logo with user-provided image",
  "requirements": [
    {
      "id": "REQ-16",
      "summary": "Create a new scheduling page with service appointment request form including customer details, service type selection, and confirmation message",
      "acceptanceCriteria": [
        "A new 'Schedule Service' link appears in the header navigation menu",
        "The scheduling page includes all required form fields with appropriate input types",
        "Form validation prevents submission with missing required fields",
        "Service type dropdown includes all six services from the ServicesGrid component",
        "Upon successful form submission, a confirmation message is displayed to the user",
        "The page maintains the existing mobile-first responsive design with deep blue and green color scheme"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Schedule.tsx",
          "operation": "create",
          "description": "Create a new Schedule page component with a form containing fields for customer name, phone number, email, service address, preferred date, preferred time window (morning/afternoon/evening dropdown), service type dropdown matching the six services (Sprinkler Repair, Sprinkler Installation, Spring Startup, Winterization, Leak Detection, System Upgrades), and additional notes textarea. Include form validation using controlled inputs and state management. Display a confirmation message upon form submission. Use Tailwind CSS classes consistent with the existing deep blue and green color scheme, and ensure mobile-first responsive design matching the Contact page styling."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add a new route for the Schedule page at path '/schedule' in the TanStack Router configuration, importing and rendering the Schedule component."
        }
      ]
    },
    {
      "id": "REQ-17",
      "summary": "Add 'Schedule Service' navigation link to header menu between Contact and phone number, routing to /schedule",
      "acceptanceCriteria": [
        "The 'Schedule Service' link appears in the Header component navigation",
        "Clicking the link navigates to /schedule route",
        "Active state styling is applied when on the scheduling page",
        "Link is responsive and appears in the mobile hamburger menu"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "Add a new 'Schedule Service' navigation link to the header menu between the 'Contact' link and the phone number section. Include the link in both desktop navigation and mobile hamburger menu. Apply active state styling using the same pattern as other navigation links (checking current route and applying text-primary class). Ensure the link routes to '/schedule' and maintains responsive behavior."
        }
      ]
    },
    {
      "id": "REQ-18",
      "summary": "Replace all instances of R Irrigation logo with user-provided logo image file, maintaining sizing and responsive behavior",
      "acceptanceCriteria": [
        "The new logo image replaces the existing R Irrigation logo in the Header component",
        "Logo maintains appropriate dimensions and aspect ratio on desktop and mobile",
        "Logo is clickable and navigates to the homepage",
        "Logo displays clearly on both light and dark backgrounds if applicable",
        "Image is optimized for web delivery"
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/9962DF11-5A7E-4582-A58F-DBC7D2FE64A8.png",
          "operation": "create",
          "description": "Copy the user-provided logo image file (9962DF11-5A7E-4582-A58F-DBC7D2FE64A8.png) to the frontend public assets directory for use as the new R Irrigation logo."
        },
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "Replace the existing logo image source with the new logo image at '/assets/9962DF11-5A7E-4582-A58F-DBC7D2FE64A8.png'. Maintain the existing logo sizing classes and responsive behavior. Ensure the logo remains clickable and navigates to the homepage. Adjust width/height attributes if needed to maintain proper aspect ratio while keeping the logo appropriately sized for both desktop and mobile views."
        }
      ]
    },
    {
      "id": "REQ-19",
      "summary": "Add prominent 'Schedule Service' CTA buttons to homepage HeroSection and CTABlock component driving traffic to scheduling page",
      "acceptanceCriteria": [
        "A 'Schedule Service' button appears in the HeroSection with consistent styling to existing CTA buttons",
        "A 'Schedule Service' button or link appears in the CTABlock component",
        "Buttons use the bright green accent color to stand out",
        "Clicking buttons navigates to /schedule route",
        "Buttons are mobile-responsive and maintain hierarchy with phone number CTA"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/HeroSection.tsx",
          "operation": "modify",
          "description": "Add a new 'Schedule Service' button to the CTA button group alongside the existing 'Call Now' and 'Request Free Estimate' buttons. Use consistent styling with the existing buttons, applying the bright green accent color (bg-secondary class) to make it stand out. Ensure the button navigates to '/schedule' route using Link component. Maintain responsive button layout and sizing for mobile devices."
        },
        {
          "path": "frontend/src/components/CTABlock.tsx",
          "operation": "modify",
          "description": "Add a 'Schedule Service' button or link to the CTABlock component alongside the existing 'Request Free Estimate' button. Use the bright green accent color (bg-secondary or similar) for visual prominence. Ensure the button/link navigates to '/schedule' route. Maintain the existing visual hierarchy with the phone number remaining the primary CTA, and ensure mobile responsiveness."
        }
      ]
    }
  ]
}